"Common.Cancel" = "Annulla";

"Common.OK" = "OK";

"Common.Info" = "Info";

"Common.Warning" = "Messaggio di avvertimento";

"Common.Error" = "Errore";

"Common.Yes" = "Sì";

"Common.No" = "No";

"Common.Settings" = "Parametrizzazione";

"Common.Logout" = "Disconnetti";

/* MARK: - Endpoint */
"Endpoint.Training" = "https://ubilabstest.sapsailing.com";

/* MARK: - RegattaCheckInController */
"RegattaCheckInController.WelcomeAlert.Title" = "Salve %@";

"RegattaCheckInController.WelcomeAlert.Message" = "Ti stai registrando come %@.";

"RegattaCheckInController.WelcomeAlert.CancelAction.Title" = "Non sono io!";

/* MARK: - GPSFixController */
"GPSFixController.Mode" = "Sessione";

"GPSFixController.Mode.Error" = "Errore API";

"GPSFixController.Mode.BatterySaving" = "Salvataggio batteria";

"GPSFixController.Mode.None" = "-";

"GPSFixController.Mode.Online" = "Online";

"GPSFixController.Mode.Offline" = "Offline";

/* MARK: - LocationManager */
"LocationManager.LocationServicesDeniedError" = "Il GPS è disattivato per questa app, ma il tracciamento richiede posizioni GPS. Attivare il GPS con la parametrizzazione dell'ubicazione?";

"LocationManager.LocationServicesDisabledError" = "Il GPS è disattivato ma il tracciamento richiede posizioni GPS. Attivare il GPS con la parametrizzazione dell'ubicazione?";

"LocationManager.Status" = "Stato";

"LocationManager.Status.Tracking" = "Tracciamento";

"LocationManager.Status.NotTracking" = "Assenza di segnale GPS!";

/* MARK: - CheckInDataCollectorError */
"CheckInDataCollectorError.CheckInDataIsIncomplete" = "Nessun ID concorrente o segnale trovato in codice QR.";

/* MARK: - CheckInRequestManagerError */
"CheckInRequestManagerError.CommunicationFailed" = "Impossibile completare l'operazione sul server. Riprovare.";

"CheckInRequestManagerError.GetBoatFailed" = "Impossibile acquisire barca.";

"CheckInRequestManagerError.GetCompetitorFailed" = "Impossibile acquisire concorrente.";

"CheckInRequestManagerError.GetEventFailed" = "Impossibile acquisire evento.";

"CheckInRequestManagerError.GetLeaderboardFailed" = "Impossibile acquisire classifica.";

"CheckInRequestManagerError.GetMarkFailed" = "Impossibile acquisire posizione classifica.";

"CheckInRequestManagerError.GetTeamFailed" = "Impossibile acquisire squadra.";

"CheckInRequestManagerError.PostCheckInFailed" = "Check-in non riuscito.";

"CheckInRequestManagerError.PostCheckOutFailed" = "Check-out non riuscito.";

"CheckInRequestManagerError.PostGPSFixFailed" = "Impossibile inviare posizioni GPS.";

"CheckInRequestManagerError.PostTeamImageFailed" = "Impossibile caricare foto della squadra.";

"CheckInRequestManagerError.TeamImageURLIsInvalid" = "L'URL dell'immagine della squadra non è valido.";

/* MARK: - StartView */
"StartView.RegattaButton.Title" = "Regate";

"StartView.TrainingButton.Title" = "Singolo allenamento";

/* MARK: - AboutView */
"AboutView.Title" = "Informazioni sull'app";

"AboutView.PartnershipTextView.Text" = "L'applicazione SAP Sail InSight supporta il tracciamento in tempo reale di barche da competizione sfruttando la tecnologia della telefonia mobile, offrendo ad amici e fan l'opportunità di seguire la gara sia sul posto che online attraverso classifiche live e visualizzazione 2D. I velisti al seguito possono riprodurre le proprie gare per rivedere le prestazioni e ottimizzare le strategie, tutto all'indirizzo: https://www.sapsailing.com\n\nSAP supporta la US Sailing con l'implementazione di una gamma di innovative soluzioni tecnologiche per effettuare analisi che consentono a squadre e velisti di migliorare le prestazioni e mettendo a disposizione applicazioni che aumentano l'efficienza delle operazioni di navigazione.\n\nIn qualità di ente governativo per la vela, la US Sailing offre leadership, integrità e sviluppo per lo sport, inclusi programmi di allenamento e formazione per istruttori e ufficiali di gara, unitamente a compiti amministrativi e di controllo per la vela agonistica in tutto il paese.";

"AboutView.TermsButton.Title" = "Licenza per utente finale";

"AboutView.VersionTitleLabel.Text" = "Versione";

/* MARK: - CourseView */
"CourseView.TitleLabel.Text" = "Rotta effettiva al fondo";

/* MARK: - RegattaCheckInListView */
"RegattaCheckInListView.Title" = "Regate";

"RegattaCheckInListView.HeaderTitleLabel.Text" = "Le tue regate:";

"RegattaCheckInListView.FooterTextView.Text" = "Ulteriori informazioni all'indirizzo\nhttps://sapsailing.com";

"RegattaCheckInListView.InfoCodeLabel.Text" = "Il codice QR è riportato sulla tua conferma di partecipazione.";

"RegattaCheckInListView.TermsAlert.Title" = "Licenza per utente finale";

"RegattaCheckInListView.TermsAlert.Message" = "Utilizzando questa App si conferma di accettare il contratto di licenza per utente finale SAP SE. Leggere il contratto di licenza per utente finale qui.";

"RegattaCheckInListView.TermsAlert.ShowTermsAction.Title" = "Licenza per utente finale";

"RegattaCheckInListView.TermsAlert.AcceptTermsAction.Title" = "Conferma";

"RegattaCheckInListView.NoCameraAlert.Message" = "Il dispositivo non dispone di fotocamera.";

"RegattaCheckInListView.NoCodeAlert.Title" = "Non hai un codice QR?";

"RegattaCheckInListView.NoCodeAlert.Message" = "Se non hai ricevuto un codice QR contatta i responsabili della gestione della gara.";

/* MARK: - TrainingCheckInListView */
"TrainingCheckInListView.Title" = "Allenamenti";

"TrainingCheckInListView.HeaderTitleLabel.Text" = "I tuoi allenamenti:";

"TrainingCheckInListView.FooterTextView.Text" = "Per gestire le tue sessioni di allenamento, crea almeno un allenamento utilizzando il pulsante Più.";

/* MARK: - TrainingView */
"TrainingView.LeaderboardButton.Title" = "Analizza";

"TrainingView.OptionSheet.CheckOutAction.Title" = "Rimuovi allenamento";

"TrainingView.FinishButton.Title" = "Completa";

"TrainingView.ReactivateAlert.Title" = "Riattiva allenamento";

"TrainingView.ReactivateAlert.Message" = "Questa sessione di allenamento è terminata. Procedere e riattivare questa sessione?";

"TrainingView.ReactivatedAlert.Title" = "La sessione di allenamento è ora attiva.";

"TrainingView.FinishAlert.Title" = "Termina allenamento";

"TrainingView.FinishAlert.Message" = "Terminare questa sessione di allenamento?";

"TrainingView.FinishedAlert.Title" = "La sessione di allenamento è stata correttamente terminata.";

"TrainingView.CheckOutAlert.Message" = "CONFERMARE la rimozione di questa sessione di allenamento dal dispositivo?";

/* MARK: - CreateTrainingView */
"CreateTrainingView.Title" = "Crea allenamento";

"CreateTrainingView.BoatClassNameLabel.Text" = "Classe barche";

"CreateTrainingView.CreateTrainingButton.Title" = "Crea allenamento";

/* MARK: - LeaderboardView */
"LeaderboardView.Title" = "Classifica";

/* MARK: - LicenseView */
"LicenseView.Title" = "Informazioni sulla licenza";

/* MARK: - RegattaView */
"RegattaView.CountdownDaysTitleLabel.Text" = "Giorni";

"RegattaView.CountdownHoursTitleLabel.Text" = "Ore";

"RegattaView.CountdownMinutesTitleLabel.Text" = "Minuti";

"RegattaView.StartLabel.Text.BeforeRegattaDidStart" = "La regata inizierà fra:";

"RegattaView.StartLabel.Text.AfterRegattaDidStart" = "La regata è in corso.";

"RegattaView.AnnouncementLabel.Text" = "Ascolta le comunicazioni.";

"RegattaView.EventButton.Title" = "Evento";

"RegattaView.StartTrackingButton.Title" = "Avvia tracciamento";

"RegattaView.OptionSheet.CheckOutAction.Title" = "Checkout";

"RegattaView.CheckOutAlert.Message" = "CONFERMARE il logout? Sarà necessario rieseguire la connessione con il codice QR fornito per accedere alla regata!";

/* MARK: - CompetitorView */
"CompetitorView.SelectImageAlert.Title" = "Foto";

"CompetitorView.SelectImageAlert.Message" = "Utilizzare un'immagine esistente o acquisirne una nuova?";

"CompetitorView.SelectImageAlert.CameraAction.Title" = "Scatta una foto";

"CompetitorView.SelectImageAlert.PhotoLibraryAction.Title" = "Esistente";

"CompetitorView.TeamImageUploadRetryButton.Title" = "Errore nel caricamento.\nToccare per riprovare.";

"CompetitorView.TeamImageAddButton.Title" = "Aggiungi foto della squadra";

"CompetitorView.UploadTeamImageFailureAlert.Title" = "Errore nel caricamento dell'immagine";

/* MARK: - ScanView */
"ScanView.Title" = "Scannerizza codice QR";

"ScanView.IncorrectCodeAlert.Message" = "Codice QR non valido";

/* MARK: - SpeedView */
"SpeedView.TitleLabel.Text" = "Velocità effettiva al fondo";

/* MARK: - SettingsView */
"SettingsView.Title" = "Parametrizzazione";

"SettingsView.TableView.BatterySavingSection.Title" = "Salvataggio batteria";

"SettingsView.TableView.DeviceSection.Title" = "Informazioni apparecchiatura";

"SettingsView.TableView.TrainingSection.Title" = "Area di allenamento";

"SettingsView.BatterySavingTitleLabel.Text" = "Risparmia energia";

"SettingsView.BatterySavingDescriptionLabel.Text" = "Gli aggiornamenti GPS vengono inviati al server ogni %0.0f secondi.";

"SettingsView.DeviceIdentifierTitleLabel.Text" = "Identificatore dispositivo";

"SettingsView.TrainingServerTitleLabel.Text" = "Punto di accesso del server";

/* MARK: - TimerView */
"TimerView.TitleLabel.Text" = "Tempo di tracciamento";

/* MARK: - TrackingView */
"TrackingView.TableView.GPSFixesCell.GPSFixesTitleLabel.Text" = "Punti nave non inviati";

"TrackingView.TableView.GPSAccuracyCell.GPSAccuracyTitleLabel.Text" = "Accuratezza GPS";

"TrackingView.TableView.GPSAccuracyCell.GPSAccuracyLabel.Text.NoGPS" = "nessun GPS";

"TrackingView.StopTrackingButton.Title" = "Arresta tracciamento";

"TrackingView.StopTrackingAlert.Title" = "Conferma";

"TrackingView.StopTrackingAlert.Message" = "Confermare l'arresto del tracciamento?";

